## Production: sqs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 2 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_sqs_queue.audit_log_deadletter_queue will be created
  + resource "aws_sqs_queue" "audit_log_deadletter_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 60
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "audit_log_deadletter_queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 5
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.audit_log_queue will be created
  + resource "aws_sqs_queue" "audit_log_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 2048
      + message_retention_seconds         = 172800
      + name                              = "audit_log_queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 1960
    }

  # aws_sqs_queue.deadletter_queue will be destroyed
  # (because aws_sqs_queue.deadletter_queue is not in configuration)
  - resource "aws_sqs_queue" "deadletter_queue" {
      - arn                               = "arn:aws:sqs:ca-central-1:957818836222:deadletter_queue.fifo" -> null
      - content_based_deduplication       = true -> null
      - deduplication_scope               = "queue" -> null
      - delay_seconds                     = 60 -> null
      - fifo_queue                        = true -> null
      - fifo_throughput_limit             = "perQueue" -> null
      - id                                = "https://sqs.ca-central-1.amazonaws.com/957818836222/deadletter_queue.fifo" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - kms_master_key_id                 = "alias/aws/sqs" -> null
      - max_message_size                  = 262144 -> null
      - message_retention_seconds         = 1209600 -> null
      - name                              = "deadletter_queue.fifo" -> null
      - receive_wait_time_seconds         = 20 -> null
      - sqs_managed_sse_enabled           = false -> null
      - tags                              = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                          = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - url                               = "https://sqs.ca-central-1.amazonaws.com/957818836222/deadletter_queue.fifo" -> null
      - visibility_timeout_seconds        = 30 -> null
    }

  # aws_sqs_queue.reliability_deadletter_queue will be created
  + resource "aws_sqs_queue" "reliability_deadletter_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = true
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 60
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "reliability_deadletter_queue.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.reliability_queue will be updated in-place
  ~ resource "aws_sqs_queue" "reliability_queue" {
        id                                = "https://sqs.ca-central-1.amazonaws.com/957818836222/submission_processing.fifo"
        name                              = "submission_processing.fifo"
      ~ redrive_policy                    = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:ca-central-1:957818836222:deadletter_queue.fifo"
              - maxReceiveCount     = 5
            }
        ) -> (known after apply)
        tags                              = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ visibility_timeout_seconds        = 400 -> 1800
        # (14 unchanged attributes hidden)
    }

  # aws_sqs_queue.reprocess_submission_queue will be updated in-place
  ~ resource "aws_sqs_queue" "reprocess_submission_queue" {
        id                                = "https://sqs.ca-central-1.amazonaws.com/957818836222/reprocess_submission_queue.fifo"
        name                              = "reprocess_submission_queue.fifo"
      ~ redrive_policy                    = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:ca-central-1:957818836222:deadletter_queue.fifo"
              - maxReceiveCount     = 5
            }
        ) -> (known after apply)
        tags                              = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ visibility_timeout_seconds        = 400 -> 1800
        # (14 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  + sqs_audit_log_deadletter_queue_arn   = (known after apply)
  + sqs_audit_log_queue_arn              = (known after apply)
  + sqs_audit_log_queue_id               = (known after apply)
  - sqs_dead_letter_queue_id             = "https://sqs.ca-central-1.amazonaws.com/957818836222/deadletter_queue.fifo" -> null
  - sqs_deadletter_queue_arn             = "deadletter_queue.fifo" -> null
  + sqs_reliability_dead_letter_queue_id = (known after apply)
  + sqs_reliability_deadletter_queue_arn = "reliability_deadletter_queue.fifo"
  + sqs_reprocess_submission_queue_id    = "https://sqs.ca-central-1.amazonaws.com/957818836222/reprocess_submission_queue.fifo"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
